/**************************************************************************
*   
*   =======================================================================
*   CLR 版本    ：4.0.30319.42000
*   命名空间    ：Stack.WeChat.DataContract.Enums
*   文件名称    ：RequestMessageType.cs
*   =======================================================================
*   创 建 者    ：李廷礼
*   创建日期    ：2019/6/27 14:30:09 
*   邮    箱    ：litingxian@live.cn
*   个人主站    ：https://github.com/tingli1991
*   功能描述    ：
*   使用说明    ：
*   ========================================================================
*   修改者      ：
*   修改日期    ：
*   修改内容    ：
*   ========================================================================
*  
***************************************************************************/

namespace Stack.WeChat.DataContract.Enums
{
    /// <summary>
    /// 消息类型
    /// </summary>
    public enum MessageType
    {
        /// <summary>
        /// 文本消息
        /// </summary>
        Text = 1,

        /// <summary>
        /// 图片消息
        /// </summary>
        Image = 2,

        /// <summary>
        /// 语音消息
        /// </summary>
        Voice = 3,

        /// <summary>
        /// 视频消息
        /// </summary>
        Video = 4,

        /// <summary>
        /// 小视频消息
        /// </summary>
        ShortVideo = 5,

        /// <summary>
        /// 地理位置消息
        /// </summary>
        Location = 6,

        /// <summary>
        /// 链接消息
        /// </summary>
        Link = 7,

        /// <summary>
        /// 事件类型消息
        /// </summary>
        Event = 8
    }
}